{/* مكتبة multer دي هي "بواب السيرفر" بتاعي.*/ }
{/* multer هو الـ "Middleware" (الوسيط) اللي بيستقبل الـ Request ده قبل الكود بتاعك، بيبص جواه، بيطلع منه الصو، ويجهزها للكود بتاعك. */ }

import multer from "multer";

// السطر ده معناه: جهز Multer إنه يستقبل الملفات ويخليها في الذاكرة (RAM)
// من غير ما يحفظها على الهارد ديسك
const upload = multer();

// هنا بنعمل export للـ middleware ده عشان الروابط تستخدمه
export default upload;

// ملخص الملخص:

// multer: (الوسيط) بيستلم الصورة من اليوزر ويحطها في الـ RAM.

// imagekit: (الرافع) بياخدها من الـ RAM ويرميها على الكلاود